#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shuuren/shuuren-alpha/runs/run-FuVRoTEqNQnCJuhf

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.archive_file.api_character_file: Reading...
data.archive_file.signup: Reading...
data.archive_file.api_character_file: Read complete after 0s [id=e21710e34ba2e4a76bf01a54d7969ceb9bc851af]
data.archive_file.signup: Read complete after 0s [id=6c21b48943481d4f6cb249fab0eaaad0281afe57]
aws_acm_certificate.shuuren_cert: Refreshing state... [id=arn:aws:acm:us-east-1:265390238424:certificate/adf4603e-1f50-4653-b239-ade0bcb8362d]
aws_api_gateway_resource.shuuren_api_character: Refreshing state... [id=041x8i]
aws_lambda_function.get_character: Refreshing state... [id=get_character]
aws_iam_policy.character_api_policy: Refreshing state... [id=arn:aws:iam::265390238424:policy/character_api_policy]
aws_lambda_permission.allow_get_character_api_gateway: Refreshing state... [id=AllowExecutionFromAPIGatewayCharacterGet]
aws_api_gateway_method.shuuren_api_character_post: Refreshing state... [id=agm-kvf6m5r20e-041x8i-POST]
aws_api_gateway_integration.update_character_integration: Refreshing state... [id=agi-kvf6m5r20e-041x8i-POST]
aws_iam_role.character_api_role: Refreshing state... [id=character_api_role]
aws_api_gateway_integration.get_character_integration: Refreshing state... [id=agi-kvf6m5r20e-041x8i-GET]
aws_lambda_function.update_character: Refreshing state... [id=update_character]
aws_api_gateway_method.shuuren_api_character_get: Refreshing state... [id=agm-kvf6m5r20e-041x8i-GET]
aws_iam_role_policy_attachment.character_api_policy_attachment: Refreshing state... [id=character_api_role-20221008005716699000000001]
aws_lambda_permission.allow_api_gateway: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_iam_policy.signup_event_policy: Refreshing state... [id=arn:aws:iam::265390238424:policy/signup_event_policy]
aws_iam_role.signup_event_role: Refreshing state... [id=signup_event_role]
aws_api_gateway_rest_api.shuuren_api_gateway_rest_api: Refreshing state... [id=kvf6m5r20e]
aws_dynamodb_table.character: Refreshing state... [id=character]
aws_api_gateway_rest_api_policy.shuuren_api_policy: Refreshing state... [id=kvf6m5r20e]
aws_api_gateway_deployment.shuuren_api_deployment: Refreshing state... [id=jbdokt]
aws_api_gateway_resource.shuuren_api_user: Refreshing state... [id=pbfffe]
aws_api_gateway_method.shuuren_api_user_get: Refreshing state... [id=agm-kvf6m5r20e-pbfffe-GET]
aws_api_gateway_stage.shuuren_api_stage: Refreshing state... [id=ags-kvf6m5r20e-api]
aws_acm_certificate_validation.shuuren_cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_api_gateway_integration.shuuren_api_user_get_integration: Refreshing state... [id=agi-kvf6m5r20e-pbfffe-GET]
aws_api_gateway_domain_name.shuuren_api_gateway_custom_domain: Refreshing state... [id=api.shuuren.com]
aws_api_gateway_base_path_mapping.shuuren_api_mapping: Refreshing state... [id=api.shuuren.com/]
aws_iam_role_policy_attachment.signup_event_policy_attachment: Refreshing state... [id=signup_event_role-20221007045500101300000001]
aws_lambda_function.signup_post_confirmation: Refreshing state... [id=signup_post_confirmation]
aws_cognito_user_pool.shuuren_user_pool: Refreshing state... [id=us-east-1_KFBySRRrW]
aws_cognito_user_pool_domain.shuuren_auth_domain: Refreshing state... [id=auth.shuuren.com]
aws_lambda_permission.allow_cognito_post_confirmation: Refreshing state... [id=AllowExecutionFromCognito]
aws_cognito_user_pool_client.shuuren_client: Refreshing state... [id=5t6dfe58g76h8vkmcfvb2o6keu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.shuuren_api_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "shuuren_api_deployment" {
      ~ created_date  = "2022-10-30T18:14:49Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:265390238424:kvf6m5r20e/" -> (known after apply)
      ~ id            = "jbdokt" -> (known after apply)
      ~ invoke_url    = "https://kvf6m5r20e.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "f6ff9c6e3e7a51bd30037be0784566634c002a0d" -> "45b524d7a37f3423e3cbfd71b5228a15e73cc681"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_integration.api_character_integration will be created
  + resource "aws_api_gateway_integration" "api_character_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kvf6m5r20e"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.get_character_integration will be destroyed
  # (because aws_api_gateway_integration.get_character_integration is not in configuration)
  - resource "aws_api_gateway_integration" "get_character_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "041x8i" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kvf6m5r20e-041x8i-GET" -> null
      - integration_http_method = "GET" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "041x8i" -> null
      - rest_api_id             = "kvf6m5r20e" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:265390238424:function:get_character/invocations" -> null
    }

  # aws_api_gateway_integration.update_character_integration will be destroyed
  # (because aws_api_gateway_integration.update_character_integration is not in configuration)
  - resource "aws_api_gateway_integration" "update_character_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "041x8i" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-kvf6m5r20e-041x8i-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "041x8i" -> null
      - rest_api_id             = "kvf6m5r20e" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:265390238424:function:update_character/invocations" -> null
    }

  # aws_api_gateway_method.api_character_method will be created
  + resource "aws_api_gateway_method" "api_character_method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "ANY"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kvf6m5r20e"
    }

  # aws_api_gateway_method.shuuren_api_character_get will be destroyed
  # (because aws_api_gateway_method.shuuren_api_character_get is not in configuration)
  - resource "aws_api_gateway_method" "shuuren_api_character_get" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kvf6m5r20e-041x8i-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "041x8i" -> null
      - rest_api_id          = "kvf6m5r20e" -> null
    }

  # aws_api_gateway_method.shuuren_api_character_post will be destroyed
  # (because aws_api_gateway_method.shuuren_api_character_post is not in configuration)
  - resource "aws_api_gateway_method" "shuuren_api_character_post" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "POST" -> null
      - id                   = "agm-kvf6m5r20e-041x8i-POST" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "041x8i" -> null
      - rest_api_id          = "kvf6m5r20e" -> null
    }

  # aws_api_gateway_resource.api_character_resource will be created
  + resource "aws_api_gateway_resource" "api_character_resource" {
      + id          = (known after apply)
      + parent_id   = "x7no2x9y44"
      + path        = (known after apply)
      + path_part   = "character"
      + rest_api_id = "kvf6m5r20e"
    }

  # aws_api_gateway_resource.shuuren_api_character will be destroyed
  # (because aws_api_gateway_resource.shuuren_api_character is not in configuration)
  - resource "aws_api_gateway_resource" "shuuren_api_character" {
      - id          = "041x8i" -> null
      - parent_id   = "x7no2x9y44" -> null
      - path        = "/character" -> null
      - path_part   = "character" -> null
      - rest_api_id = "kvf6m5r20e" -> null
    }

  # aws_api_gateway_stage.shuuren_api_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "shuuren_api_stage" {
      ~ deployment_id         = "jbdokt" -> (known after apply)
        id                    = "ags-kvf6m5r20e-api"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_iam_policy.api_character_policy will be created
  + resource "aws_iam_policy" "api_character_policy" {
      + arn         = (known after apply)
      + description = "iam policy for character api lambda"
      + id          = (known after apply)
      + name        = "api_character_policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:BatchGetItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:Query",
                          + "dynamodb:Scan",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:UpdateItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.character_api_policy will be destroyed
  # (because aws_iam_policy.character_api_policy is not in configuration)
  - resource "aws_iam_policy" "character_api_policy" {
      - arn         = "arn:aws:iam::265390238424:policy/character_api_policy" -> null
      - description = "iam policy for character api lambda" -> null
      - id          = "arn:aws:iam::265390238424:policy/character_api_policy" -> null
      - name        = "character_api_policy" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:BatchGetItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:Query",
                          - "dynamodb:Scan",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:UpdateItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:*:*:*"
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAT3ST5VLMCOJINY7UX" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # aws_iam_role.api_character_role will be created
  + resource "aws_iam_role" "api_character_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "api_character_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.character_api_role will be destroyed
  # (because aws_iam_role.character_api_role is not in configuration)
  - resource "aws_iam_role" "character_api_role" {
      - arn                   = "arn:aws:iam::265390238424:role/character_api_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-10-08T00:57:16Z" -> null
      - force_detach_policies = false -> null
      - id                    = "character_api_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::265390238424:policy/character_api_policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "character_api_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAT3ST5VLMA3GSTRW22" -> null
    }

  # aws_iam_role_policy_attachment.api_character_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "api_character_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "api_character_role"
    }

  # aws_iam_role_policy_attachment.character_api_policy_attachment will be destroyed
  # (because aws_iam_role_policy_attachment.character_api_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "character_api_policy_attachment" {
      - id         = "character_api_role-20221008005716699000000001" -> null
      - policy_arn = "arn:aws:iam::265390238424:policy/character_api_policy" -> null
      - role       = "character_api_role" -> null
    }

  # aws_lambda_function.api_character_function will be created
  + resource "aws_lambda_function" "api_character_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "character.zip"
      + function_name                  = "character"
      + handler                        = "character.character_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "hzKaOUhouwQurEXfq+az63pRcDVbkC62A9/K3tHUW4w="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.get_character will be destroyed
  # (because aws_lambda_function.get_character is not in configuration)
  - resource "aws_lambda_function" "get_character" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:265390238424:function:get_character" -> null
      - filename                       = "character.zip" -> null
      - function_name                  = "get_character" -> null
      - handler                        = "get_character.get_character_handler" -> null
      - id                             = "get_character" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:265390238424:function:get_character/invocations" -> null
      - last_modified                  = "2022-10-29T17:34:49.397+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:265390238424:function:get_character:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:265390238424:function:get_character:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::265390238424:role/character_api_role" -> null
      - runtime                        = "python3.9" -> null
      - source_code_hash               = "uKQWwwzcfbL6QeuiCgcwtFXyLtV0rwiBRhzx86D9Fxs=" -> null
      - source_code_size               = 1542 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.update_character will be destroyed
  # (because aws_lambda_function.update_character is not in configuration)
  - resource "aws_lambda_function" "update_character" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:265390238424:function:update_character" -> null
      - filename                       = "character.zip" -> null
      - function_name                  = "update_character" -> null
      - handler                        = "update_character.update_character_handler" -> null
      - id                             = "update_character" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:265390238424:function:update_character/invocations" -> null
      - last_modified                  = "2022-10-29T17:34:49.323+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:265390238424:function:update_character:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:265390238424:function:update_character:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::265390238424:role/character_api_role" -> null
      - runtime                        = "python3.9" -> null
      - source_code_hash               = "uKQWwwzcfbL6QeuiCgcwtFXyLtV0rwiBRhzx86D9Fxs=" -> null
      - source_code_size               = 1542 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_permission.allow_api_gateway will be destroyed
  # (because aws_lambda_permission.allow_api_gateway is not in configuration)
  - resource "aws_lambda_permission" "allow_api_gateway" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "update_character" -> null
      - id            = "AllowExecutionFromAPIGateway" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - source_arn    = "arn:aws:execute-api:us-east-1:265390238424:kvf6m5r20e/*/POST/character" -> null
      - statement_id  = "AllowExecutionFromAPIGateway" -> null
    }

  # aws_lambda_permission.allow_get_character_api_gateway will be destroyed
  # (because aws_lambda_permission.allow_get_character_api_gateway is not in configuration)
  - resource "aws_lambda_permission" "allow_get_character_api_gateway" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "get_character" -> null
      - id            = "AllowExecutionFromAPIGatewayCharacterGet" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - source_arn    = "arn:aws:execute-api:us-east-1:265390238424:kvf6m5r20e/*/GET/character" -> null
      - statement_id  = "AllowExecutionFromAPIGatewayCharacterGet" -> null
    }

  # aws_lambda_permission.api_character_permission will be created
  + resource "aws_lambda_permission" "api_character_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "character"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "APICharacterPermission"
      + statement_id_prefix = (known after apply)
    }

Plan: 9 to add, 1 to change, 13 to destroy.


```
</details>
*Pushed by: @rise-sudo, Action: `pull_request`*